class CallbackData:
    REPLY = 'reply'
    STOP = 'stop'


class Text:
    READ_HEART = '❤️'
    BLACK_HEART = '🖤'
    REPLY = 'Відповісти'
    STOP = '❌Зупинити'

    HELLO = (
        "👋 Привіт, мене звати Свайпі🙃\n"
        "\n"
        "Відправ мені повідомлення, щоб створити тему для обговорення з іншими учасниками спільноти.\n"
        "\n"
        "Повідомлення може бути текстове, звукове, відео, стікер, світлина тощо (не підтримуються поки що хіба "
        "повідомлення-опитування).\n"
        "\n"
        "Або ж просто залишайся на зв`язку та відповідай на повідомлення, що надходитимуть.\n"
        "\n"
        "Якщо ти створиш тему для обговорення, вона буде <i><b>анонімно</b></i> надіслана <i><b>усім</b></i> "
        "учасникам спільноти.\n"
        "\n"
        "А якщо ти відповіси на повідомлення, що надійшло тобі, твою відповідь побачить <i><b>лише</b></i> автор "
        "повідомлення, що надійшло (це буде також анонімно).\n"
        "\n"
        "<i><u><b>P. S.</b></u></i> <i>Якщо я раптом надокучатиму, Телеграм дозволяє відключити мої сповіщення "
        "на годину, на 4 години, на 8 годин, на день, на 3 дні, а також назавжди (у останньому випадку ти зможеш "
        "заглядати сюди при бажанні).</i>"
    )

    TALK_NOT_FOUND = '💔 Розмову не знайдено'
    TALK_STOPPED = '🚧 Ця функція поки що не реалізована'

    NEW_TOPIC_STARTED = 'Ви створили нову тему для розмов - очікуйте відповідей ⏳'
    REVOKE_TOPIC = '⛔️Відкликати'

    MESSAGE_NOT_TRANSMITTED = 'Повідомлення не відправлено 😞'
    FAILED_TO_EDIT_AT_RECEIVER = 'Не вдалося відредакгувати у отримувача 😞'
