class CallbackData:
    REPLY = 'reply'
    STOP = 'stop'


class Text:
    READ_HEART = '❤️'
    BLACK_HEART = '🖤'
    REPLY = 'Відповісти'
    STOP = '❌Зупинити'

    HELLO = 'Здоров'

    TALK_NOT_FOUND = '💔 Розмову не знайдено'
    TALK_STOPPED = '❌ Розмову зупинено'

    NEW_TOPIC_STARTED = 'Ви створили нову тему для розмов - очікуйте відповідей ⏳'
    REVOKE_TOPIC = '⛔️Відкликати'

    MESSAGE_NOT_TRANSMITTED = 'Повідомлення не відправлено 😞'
    FAILED_TO_EDIT_AT_RECEIVER = 'Не вдалося відредакгувати у отримувача 😞'
