class CallbackData:
    REPLY = 'reply'


class Commands:
    START = 'start'
    HELP = 'help'
    ABOUT = 'about'


class Text:
    HELP = (
        "👋 Привіт, мене звати Свайпі🙃\n"
        "\n"
        "Відправте мені повідомлення, щоб створити тему для анонімного обговорення з іншими учасниками спільноти.\n"
        "\n"
        "Повідомлення може бути текстовим, голосовим, світлиною, наліпкою, анімацією, опитуванням, відео тощо.\n"
        "\n"
        "Також можете просто залишатись на зв`язку та відповідати на повідомлення-теми, які вас зацікавлять.\n"
        "\n"
        "Щоб відповісти на повідомлення, проведіть по ньому пальцем вліво⬅️ або ж скористайтесь опцією "
        "\"Відповісти\".\n"
        "\n"
        "--\n"
        "Чорне сердечко🖤 - повідомлення отримали не лише ви, а й інші учасники сервісу (створено нову тему).\n"
        "\n"
        "Червоне сердечко❤️ - вам відповіли і цю відповідь бачите лише ви (повідомлення-відповіді надходять лише одній "
        "людині).\n"
        "\n"
        f"/{Commands.HELP} - показати цей текст ще раз\n"
        f"/{Commands.ABOUT} - отримати більше інформації"
    )
    READ_MORE = "<i>https://toporok.medium.com/як-swipy-працює-зараз-404d70a64cfb</i>"

    READ_HEART = "❤️"
    BLACK_HEART = "🖤"
    REPLY = "Відповісти"
    # STOP = "❌Зупинити"

    NEW_TOPIC_STARTED = f"<i>Ви створили нову тему для розмов - очікуйте відповідей ⏳</i>\n/{Commands.HELP}"
    # REVOKE_TOPIC = "⛔️Відкликати"

    TALK_NOT_FOUND = f"<i>💔 Розмову не знайдено</i>\n/{Commands.HELP}"
    MESSAGE_NOT_TRANSMITTED = f"<i>Повідомлення не відправлено 😞</i>\n/{Commands.HELP}"
    FAILED_TO_EDIT_AT_RECEIVER = f"<i>Не вдалося відредагувати у отримувача 😞</i>\n/{Commands.HELP}"
